#+TITLE: Extracting Inertial Properties from X-Ray Computed Tomography: A Failed Attempt
#+AUTHOR: Falk Mielke
#+DATE: <2023-07-05 Thu>

#+SETUPFILE: latex_header.org
#+EXPORT_FILE_NAME: pt3ch7_inertials

#+BIBLIOGRAPHY: literature.bib apalike
#+BEGIN_SRC elisp :results none :exports none :tangle no
(setq bibtex-completion-bibliography
      '("literature.bib"))
#+END_SRC

#+OPTIONS: toc:t

#+STARTUP: noinlineimges showeverything entitiespretty
@@latex:\clearpage@@
#+ODT: <text:p text:style-name="PageBreak"/>


** Issue 0: Mass Mismatch and Total Mass Normalization

To confirm the outcome of the regressions above, we compared the actual mass of the femur (which is \(5.271 g\)) to the outcome of the digital approximation.

As seen in the regression (Fig. \ref{fig:density_calibration}), the majority of femur voxels have a gray value which falls right in between the two regression lines.
This also reflects in the calculated outcomes.
With the linear regression, the femur mass is calculated to be \(6.38 g\) (\(+21 \%\)).
The exponential regression yields a lower than actual mass (\(4.96 g\), \(-29 \%\)).
Though it appears that the correct regression would lie somewhere between the exponential and linear attempt, there is no data, nor theoretical justification supporting any intermediate hypothesis.
Neither is there any reason to think that all biological tissues generally fall in between the presented cases.

We conclude that, at least for a femur, the regression method is not accurate.


To exclude that problems arose from the special composition of this isolated bone, we applied a similar regression method to more complex data.

In a second experiment, a piglet body was CT scanned, virtually segmented, and analogously dissected to see whether the total mass of the virtual segments matches their actual masses.
The corresponding scan was performed at a different facility and long before the density calibration experiments, and thus the only available calibration points were air, water, and two density calibration phantoms.
Consequently, an exponential regression was used to convert gray values to density.
Although an exponential regression was used (prone to under-estimation in case of the femur), this virtual density conversion leads to a considerable over-estimation of the mass of most of the segments, and the specimen total.

This result highlights how erratic the digital density approximation is.



#+NAME: tab:pigletdissection
#+ATTR_LATEX: :environment tabular :align |l|c|c|c|
#+CAPTION: Segment mass verification on an actual piglet specimen. On the lighter segments, measurement accuracy and rounding are limiting. Note that the total mass at euthanasia was measured \(1.125 kg\), a slight loss is expected due to condensation and preservation.
#+begin_table
|-----------------+-----------------+------------+------------|
| *segment*         | *CT segmentation* | *dissection* | *difference* |
|-----------------+-----------------+------------+------------|
|-----------------+-----------------+------------+------------|
| *masses \([kg]\)* |                 |            |            |
| head            |           0.247 |      0.230 |        +7% |
| torso+trunk     |           0.666 |      0.580 |       +15% |
| LF humerus      |           0.033 |      0.027 |       +22% |
| LF radioulna    |           0.016 |      0.014 |       +14% |
| LF metacarpal   |           0.009 |      0.006 |       +50% |
| LF hoof         |           0.006 |      0.005 |       +20% |
| LH femur        |           0.052 |      0.050 |        +4% |
| LH tibiafibula  |           0.027 |      0.020 |       +35% |
| LH metatarsal   |           0.012 |      0.010 |       +20% |
| LH hoof         |           0.004 |      0.004 |        +0% |
| RF humerus      |           0.031 |      0.031 |        +0% |
| RF radioulna    |           0.019 |      0.015 |       +27% |
| RF metacarpal   |           0.008 |      0.006 |       +33% |
| RF hoof         |           0.005 |      0.005 |        +0% |
| RH femur        |           0.050 |      0.053 |        -6% |
| RH tibiafibula  |           0.023 |      0.021 |       +10% |
| RH metatarsal   |           0.013 |      0.011 |       +18% |
| RH hoof         |           0.005 |      0.003 |       +67% |
|-----------------+-----------------+------------+------------|
| *TOTAL*           |           *1.226* |      *1.091* |            |
|-----------------+-----------------+------------+------------|
|-----------------+-----------------+------------+------------|
#+TBLFM: @3$4..@-2$4=100*($2-$3)/$3;%+.0f%%
#+end_table


